{"comment":{"2":"For context: Star Atlas is a massive multiplayer space game leveraging Solana\/Serum for items and trade. Mr.Beast has 62 million subscribers on Youtube.","3":"Link to tweet:\n\nhttps:\/\/twitter.com\/MrBeast\/status\/1398435635585761283","4":"I cant wait for the solana give away video lmaoo","5":"Mr.Beast Is Part Of The Solana Ecosystem.","6":"Please don't put Elon and Solana in the same sentence.","7":"Which one is his cousin? the dude on the left?","8":"He's probably the one dumping right now.","9":"Good lord, Solana is doomed","10":"Bullish for SOL, but I honestly don't like it.","11":"https:\/\/www.crunchbase.com\/person\/lyndon-rive\n\nAlso Kevin Rose. Creator of Digg.com.","12":"All rich people have there hand in something, wish they would take there hand out of the cookie jar.","13":"Who cares about Elon. This guy is a cancer to crypto.","14":"Eventually, Elon will tweet he doesn't like Solana for whatever reason and Solana will take a dip manipulating the market as he wishes.","15":"Elon’s Cousin Was One Of Solana’s First Investors.","16":"Some bullish news published on Business Insider today! Anyone got a subscription so we can read this?","17":"Paywalled but I think they might be talking about [this podcast](https:\/\/podcasts.apple.com\/us\/podcast\/unchained\/id1123922160?i=1000523014032)?  Which is a good listen, anyway.","18":"The won't be a 1 winner takes all. Don't worry. There wont be in the blockchain\/crypto space. Just like most other markets. Try look fiat currencies. Look how many thriving cryptos we got today. They don't even need to be legit to 1000x and get on coinbase 2021. The future will bring more alternatives to ethereum blockchain - not less.","19":"Sell the news? \n\nWhen BCH fork happened the media pumped that so hard in what very much seems like a coordinated pump and dump. Same thing happened with ZCL and BTCP with the cooperation\/misleading statements with Bittrex. Additionally CB pushed back its $sol release on CBpro. Hmmm, a conspiracy theorist might say that delay was caused the 60% owners \/ CB shares dropping their BTC value on the big dip to 31k. Additionally $ETH upgrade along with $dot, $matic, and even future highways like $ela could end $sol long. Another point, many say $sol may be “better” now but we are so early, who knows what upgrades etc to other projects might change this narrative. Not saying $sol can’t make money (short and long) but I am saying everyone might be getting dumped on very hard during the follow weeks after CBpro release and dumped on harder if $sol can’t flip $ETH.\n\nI own $sol. But the timeline feels super sketchy. Diversify to protect yourself. History has shows that the “best tech” does not win more often than not.","20":"Ethereum can just make a Solana bridge. They'll be fine. One thing they could do to compete is upgrade their protocol \/ governance so that it isn't inferior.","21":"Two ether bulls break down 3 reasons why solana is an existential threat to ethereum in a 'winner takes most' market where some of today's most popular crypto networks won't survive","22":"Sollet.io connects with most","23":"I'm sold.  I want to move solidly into the Solana ecosystem. \n\nFrom someone who uses and likes (mostly) Trustwallet, I'm looking for a wallet that is easy to use with Serum and other DeFi.\n\nThanks in advance!","24":"What is the best wallet for SOL?","25":"Yo I really like marinade to","26":"Solana Hackathon Demo Day. See the projects from Parrot, Mango Markets, Foresight, Marinade (my fav), Psyoptions, Synthetify, Solrise, and Open Era in action","27":"Where can I find transaction volume on the blockchain? The number of transactions made by people using apps built on SOL\n\nNote - this is \\*not\\* the SOL coin trading volume","28":"Transaction volume on SOL blockchain","29":"Source: dude trust me right 😂. Same color band doesn't mean they support it","30":"BREAKING: COLDPLAY ENDORSE SOLANA THIS SUMMER - SOURCES. (Jk)","31":"I would just love to have all my assets on one cold-storage device.\n\nAm I the only one who wants this to happen?","32":"Will we eventually get a Ledger account for Solana?","33":"Check out this #NFT for sale on Mintable! Pick up 'Golden Cat' before its swooped up!","34":"Link to my post is here https:\/\/futureoverload.com\/2021\/05\/28\/top-8-sectors-in-crypto\/\n\nI mentioned Solana so I thought I would share this here for anyone potentially interested \n\nJust wanted to give a quick breakdown of the sectors I would keep an eye on as money will flow into these heavily, maybe not now but in the long run for sure. \nTLDR: Payments, smart contracts, cefi, defi, NFT, healthcare, gaming, DAO \n\nI know there's other important sectors that I missed but can't include everything :)","35":"Imo the most efficient is to get btc, send it to sollet wallet where it gets wrapped, & swapping that btc for spl-usdc\/usdt","36":"You can find most of the Solana Ecosystem coins on the FTX.com exchange if you are looking to do trading but if you want to purchase the coins directly from the Ecosystem there is the Serum DEX. You can send USDT to your wallet and connect your wallet to the Serum DEX and do your trade. In my opinion it is the best DEX built on any blockchain platform","37":"I buy Harmony (One) fees are nothing and confirmation is like 2 seconds. I trade it for USDT and buy Solana on [Gate.io](https:\/\/Gate.io). When I wanna use it for DEFI I send it to Sollet.\n\nTransfer fees are 0.0008 and 0.001 are nearly instant. I prefer Gate.io over Binance. I buy Harmony on Crypto.com\n\nCrypto.com > Gate.io > Sollet\n\nJust how I do it","38":"Send usdt to sollet & do swap on Raydium, Step.Finance, or any other Solana swap — it all goes to the same order book so it doesn’t matter where you swap on the network.","39":"What's the most efficient way to get capital on Salona? The only option I've come across for myself so far is to buy SOL on Binance, then send to my wallet. I don't find this particularly efficient because if I just wanted some usdt to buy some other  spl assets, I'm having to buy and sell 2 extra times.   \nIs there a bridge to any other chain that I don't know about? How have you guys been moving capital onto Solana other than sending SOL from an exchange? \nThanks for your input.","40":"Looking to make the switch..","51":"I’m thinking of investing in SOL, and I get these positive news everywhere. Right time to buy I guess","52":"Even though I don't understand technically enough, I just want to say keep up the good work guys.\n\n\\*vested\\*","53":"No problem, anytime .. get to 100 hapi and ya can come join our private hapi group in telegram 😉","55":"What Dex do we grab HAPI on?","56":"Hapi is one of the most extremely bullish projects right now. I'm planning on holding this long term can't wait to see where it is headed in 5+ years","57":"How\/where can you buy HAPI? I haven't been able to find anything online","58":"What the hell is up with coinbase?","60":"Stake pools are coming. Hopefully incentives will be realigned. For now, we wait.","61":"The commission they take is only a percentage of rewards not all of it. So 10% commission of 11% rewards . Also it’s only like 10k for the hardware to run a validator. The trouble is the continual cost and physical location of the supercomputer. Not to mention you likely have to offer 0% commissions for some time to garner stake from hodlers for a while before you can have enough. I don’t think it’s too unreasonable","62":"This is one of the major weaknesses of Solana, hopefully the devs address it somehow.","63":"To participate as a validator in a way that is profitable, you need both a beefy hardware setup and a lot of stake (around 76,000 SOL according to [this](https:\/\/www.reddit.com\/r\/solana\/comments\/njkave\/what_are_solanas_weaknesses\/gz8o57w?utm_source=share&utm_medium=web2x&context=3)).\n\nIf I see this correctly, this will keep people from starting new validators in the future. What is already staked is unlikely to get un- and restaked with new validators, so it is difficult to gain new stake isn't it? Also all of the fees and inflation go to the staking validators, so the entire system seems to put power into the validators that are already there and leaves little room for new ones.\n\nThis may lead to centralization in the future, especially if validators get more coordinated, and it prevents competition among validators, because there isn't any option to start small, in the worst case.\n\nHow can this be resolved? Should large stakeholders be incentivized to sell? should there be investment funds to kickstart small validators? Any other ideas? Do I have this all wrong?","64":"Is the entry cost for validators too high? How can it be lowered?","65":"Im not sure if Solana smart contract execution works similarly to Ethereum (so anyone can correct me if it does) but Fees serve a different purpose on a Turing complete platform (like ethereum or others) than they do for a non-Turing complete chain such as Bitcoin, where they may act as spam resistance. In Turing complete systems, They serve as a protection mechanism against infinite loops. You know when your computer freezes and the spiny wheel keeps going and going and the only thing to do is to turn it off and turn it on? Imagine if that happened but on a blockchain. There’s no way to turn it off and turn it on so instead the code running runs as long as there is fees to sustain it.","66":"There is no such thing as a free lunch. Read the Solana white paper; the fee structures are very transparent & reasonable.","67":"There is no such thing as zero fees. Nano validators are compensated through inflation. There is a tradeoff between fees and rate if inflation. Nano does not have a smart contract implementation. It makes sense to charge smart contracts gas for the number of ops executed. It is harder to keep a smart contract spamming (it might be even provably impossible for turing complete smart contracts)","68":"Well first of all, everything that you don't want to be wasted needs to have a fee associated with it, or else the resources will be wasted.\n\nIn terms of validator compensation (necessary to keep the network actually working), right now they are kind of unnecessary due to the overly large influence of stake rewards through (relatively) high inflation.\n\nEventually, there will be very little inflation and fees will be necessary to compensate validatators.","69":"Don’t forget \/r\/iota if you are talking about zero fees.","70":"Fees defend from spam attacks. As long as Nano was brought up. Why do you think the exchange wallets are always up and down on Nano?\n\nDAG+zero fees=easy cheap spam attacks.","71":"Hi, I am relatively new to Solana, although I have been in the crypto space since 2017. I early on fell in love with Nano (fee-less and instant transactions) and wonder if the fees in Solana is to prevent spam (or?) and if so (or not) it is really necessary? Nano just recently implemented a new way to handle spam, which probably could also be adapted for Solana. \n\nBecause from a consumer perspective fees really are a turn off and probably also for businesses (in terms of accounting).","72":"Why does Solana need fees?","73":"What is 2 more?  2 SOL you mean?\n\nThat's like $60+ USD worth. If your bank balance is about this amount, I think you are overexposing yourself. You should save up more.","74":"Yeah, nows the time to buy I think. Solana is being mentioned by finance people. Hopefully it gets adopted by the public in the next two years. That would be good for price. Youre still early!","75":"Been wanting to get in for a while - and I'm here!\n\nJust got in at $28. Hello everyone.","76":"[Arbitrum](https:\/\/www.reddit.com\/r\/CryptoCurrency\/comments\/ne9dle\/arbitrum_is_the_best_smart_contract_platform\/) is making Solana irrelevant, and [Uniswap voted to adopt Arbitrum](https:\/\/www.coindesk.com\/uniswap-vote-deploy-ethereum-scaler-arbitrum), not Solana.","77":"Everyday I wake up and check FTX to see what he price of Sol, then immediately check my bank account to see how much I can manage to convert that day. I know one day it will be too expensive for my broke butt to be able to buy whole coins, so I’m doing it now while I still can. I bought 2 more this am","78":"I like that he mentions SolDate. I do think he's right, a part of mass adoption will be creating Dapps like this that aren't always about trading.","79":"Co-Founder Anatoly on CoinDesk","80":"KIN, by far.\n(I will come back to this comment in 6 months)","81":"Mercurial. Sounds like it will be the Curve of Solana. Lot of potential there imo","82":"No, but I have a question: do you need to have SOL in your wallet to hold SPLs?  Docs seem to suggest you need SOL for rent and transfers.\n\nI’m not actually sure if Audius tokens are on the Solana network, they describe themselves as a hybrid, I’d like to know that too.","83":"I recently bought a lot of SOL and some RAY and SRM. Looking for other long term holds that are SOL SPL tokens. Any pointers? Thinking ROPE, STEP, MAPS, and Audius (is it spl?). Are their any IPFS like projects or decentralized search that are SPL tokens?","84":"Which version of the command line client are you using?  'solana --version' to find out.\n\nYour command looks well formed, at least as you have described it.  It does sound like the client thinks the original stake account pubkey is really a file name and is trying to read it as a file.\n\nIs it possible that you didn't type the origin stake account pubkey correctly?  Maybe you left a letter off the end (easy to do with copy-paste)?  Probably the program tries to detect valid pubkeys and if there is something malformed about the key, it treats it like a file name and then fails to open it.","85":"how did you write the command? did you just copypasta'd it from the doc?","86":"\\[UPDATE: SOLVED\\] mis-typed the origin pubkey.\n\n\\[original post\\]\n\ni recently created two stake accounts that share a vote account address and i'd like to merge them. following the docs [here](https:\/\/docs.solana.com\/cli\/usage#solana-merge-stake), i am calling this command\n\n    solana merge-stake \\\n        --fee-payer <path-to-my-fs-keypair>.json \\\n        --stake-authority <path-to-my-fs-keypair>.json \\\n        --keypair <path-to-my-fs-keypair>.json \\\n        <destination-stake-account-pubkey> \\\n        <origin-stake-account-pubkey>\n\nbut getting this error\n\n    error: Invalid value for '<SOURCE_STAKE_ACCOUNT_ADDRESS>': No such file or directory (os error 2)\n\nwhich sounds like it expects a file, not a public key\/address. any idea what's going on? thanks in advance.","87":"how to merge two (active) stake accounts with the cli? getting error \"No such file or directory\"","90":"The tokens are a fixed priced. If the pool dilutes you get less tokens and your remaining usdc left","91":"I recently participated in the MER pool, and I received a much smaller % of tokens than I expected. When the pool is over 100% funded it dilutes the shares? Seems like I lost about 90% of my initial investment. Obviously that’s my responsibility, but I’d like to understand better for the future to not make the same mistake again.","92":"How does AcceleRaytor distribute tokens?","93":"Probably because it was the first on the scene","94":"How much SOL are you sending? I sent 100 SOL the other day and I noticed it took longer than say 10 SOL. That was on command line. I also use SolFlare and noticed that when I send SOL to that wallet it does take some time for the page to refresh. I think its just the UI. on the blockchain the transaction i guarantee is faster.","95":"solfare is by far the worst Solana wallet i've experience so far. Use moonlet if you're using a ledger. much better integration and UI is clean","96":"Usually when I make a transaction with Sollet, it only takes about 2 seconds to complete. In Solflare a transaction takes about 10-20 seconds though. Why is that?","97":"Why do Solflare transactions take so \"long\"?","98":"As of right now there is nothing that exceeds the technology of Solana. It has the leading edge for scaling to billions of users without sharding (Harmony). It can do a sub-second central order book right now and theoretically achieve 710k TPS on Gigabit and 28 Million TPS on 40 Gigabit ethernet. We are a long ways away from 40 obviously. These are upper estimates as consumer hardware gets better. The bottleneck is hardware\/bandwidth.\n\nRight now on 100mbs it can do up to 65k TPS. The founder is an optimizations genius. He did optimizations for Qualcomm.\n\nIt takes 2 days to unstake I believe. Raydium &  Bonfida are the main DeFi.\n\nBlock time is 400 milliseconds currently and fees are like 0.0001.\n\nI believe EOS is second when it comes to performance tech then Harmony third.","99":"Staking SOL is super easy, you just transfer it to a staking address and pick a validator. It takes 3 days (an epoch) to start staking, and 3 when you want to stop and withdraw it back to your regular address.   \n\n\nYou don't need to do any maintenance, there are no chainsplits, no impermanent loss, no vps restarts... easy breezy. Just pick a reliable validator.  \n\n\nAPR was around 10% 30 epoch ago, 8.5% 20 epoch ago, and around 8% for the last 10 epochs","100":"Personally, I believe Solana will be among the top 10 blockchains in the years to come, probably top 3 (I hope). Many reasons were mentioned above, many more [here](https:\/\/www.businessinsider.com\/crypto-investing-trading-bull-case-solana-sol-eth-ethereum-investors-2021-5?utm_source=reddit.com). Me? I think the other players are too dev\/tech-driven. Solana is also business-driven and that will make a huge difference when we will arrive at mass adoption. But don't listen to me. If unsure and don't care too much about all the debate centralization vs decentralization, buy some on FTX (best prices by far), stake part of it (10% APR - 7 days to unlock on FTX), transfer the rest to Sollet, and start playing with Serum, Raydium or Bonfida.","101":"Institutions are buying up BTC\/dollar and calling for zero sum games. Do what you need to do. I think they are going to lose and ask for more money from their mommy’s and daddy’s. Fingers crossed regular people buy more of the dip than institutions.","104":"How To Create Sollana Wallet? How To Install And Use Sollet?","109":"Whatever it is, the timing was very good. It wouldn't have helped the price at all with BTC so fragile. Let's hope the listing happens when BTC is a bit more stable for a few days, so SOL can pump.","110":"I don’t know if my reasoning is rational, but it definitely has to do with capital. \n\nBrian Armstrong didn’t have enough invested, and listing Sol would send his competitor (our boy SBF) straight to the sun. Coinbase seems to be interested in pushing Chainlink IMHO","117":"I hope coinbase list SOL today so I can buy this dip.","123":"Yes, all state in Solana is global.  Anything that is not globally known, is not state.","124":"Quick question regarding scalability - Does solana have global state?\n\nAs in: every full validator must observe full network state, processing all the network's transactions","125":"Does solana have global state?","126":"&#x200B;\n\n>Edit: I joined serum support discord and messaged #sollet channel for help. According to the developer, there is no way to recover funds sent to a token mint address. A lesson learnt the hard way! :(\n\nThank you for updating your post so people benefit from your experience & so sorry for your loss.","137":"Might have something to do with Bitmex SOL-Perps launch on June 1st. Probably not though.\nNot really worth it IMO to worry about short term SOL movements — the crypto-space in general is plagued with a lot of bs at the moment (if that isn’t already obvious).","195":"This is not they end of the bull run, but the market probably needs to shake out more weak investors before we can start climbing again.","214":"Let it go. Time would be better spent looking out for Mercurial Finance launch (the actual project, not the token)","237":"Not yet on Solana, but I think this might be interesting seeing as Alameda have a stake in them: [https:\/\/oin.finance\/](https:\/\/oin.finance\/)\n\nFull disclosure: I own some."},"author":{"2":"MurkWahlberg2019","3":"funnytroll13","4":"BigdaddyDien69","5":"MurkWahlberg2019","6":"Next_Veterinarian985","7":"calltextdotmewebsite","8":"demslearn2fish","9":"drod3333","10":"ZenBaller","11":"MurkWahlberg2019","12":"sensei_sparky","13":"tumbleweed911","14":"Ceres_resident305","15":"MurkWahlberg2019","16":"LocksCity","17":"Agelaius-Phoeniceus","18":"qkum","19":"sittingORlaying","20":"themadscienceman","21":"LocksCity","22":"calltextdotmewebsite","23":"Trathius","24":"Trathius","25":"Adam8283","26":"tjvick","27":"autoi999","28":"autoi999","29":"Soggy_Ad6925","30":"RY_ChimaGun","31":"vers1fier","32":"vers1fier","33":"kyemrah","34":"degenerate_trader420","35":"nyr4t","36":"No_Independence_2911","37":"MurkWahlberg2019","38":"NewDadman","39":"demslearn2fish","40":"demslearn2fish","51":"Aegontarg07","52":"DPSK7878","53":"Jakeprior88","55":"Accomplished_War_493","56":"tcfsymbiote","57":"1v1mequickscopesonly","58":"ItalianSausage696969","60":"eugeneprokopenko","61":"calltextdotmewebsite","62":"QueasyEntrepreneur56","63":"mankinskin","64":"mankinskin","65":"cjwin1977","66":"NewDadman","67":"Tasty_Duty856","68":"ZantetsuLastBlade2","69":"nothingnotnever","70":"Iron0ne","71":"Jility","72":"Jility","73":"DPSK7878","74":"calltextdotmewebsite","75":"NoobPwnr","76":"bigoaktrees","77":"joesirc","78":"SlyBadger92","79":"StannisW","80":"roosteriko","81":"Shmauzow","82":"Agelaius-Phoeniceus","83":"Practical_Oil_1466","84":"ZantetsuLastBlade2","85":"SiNONiMiTY","86":"chrisossss","87":"chrisossss","90":"appledog789","91":"Kaizen336","92":"Kaizen336","93":"joesirc","94":"calltextdotmewebsite","95":"Kamikaze_FailureWB","96":"mankinskin","97":"mankinskin","98":"MurkWahlberg2019","99":"bsrxyr","100":"cr33pt00","101":"Wave-Civil","104":"CryptoSkylark","109":"ZenBaller","110":"joesirc","117":"rtruong85","123":"ZantetsuLastBlade2","124":"tinypocketmoon","125":"tinypocketmoon","126":"ansi09","137":"NewDadman","195":"SlitchBap","214":"NewDadman","237":"sz_sprint"},"score":{"2":11,"3":5,"4":2,"5":40,"6":53,"7":4,"8":3,"9":9,"10":5,"11":2,"12":3,"13":1,"14":1,"15":66,"16":6,"17":3,"18":4,"19":-3,"20":1,"21":69,"22":5,"23":8,"24":8,"25":2,"26":26,"27":1,"28":1,"29":1,"30":0,"31":1,"32":1,"33":1,"34":7,"35":2,"36":2,"37":1,"38":1,"39":6,"40":6,"51":3,"52":3,"53":3,"55":2,"56":2,"57":2,"58":1,"60":3,"61":1,"62":1,"63":9,"64":9,"65":2,"66":2,"67":3,"68":1,"69":1,"70":1,"71":8,"72":8,"73":6,"74":2,"75":2,"76":0,"77":15,"78":3,"79":16,"80":6,"81":2,"82":0,"83":6,"84":3,"85":2,"86":4,"87":4,"90":3,"91":3,"92":3,"93":1,"94":1,"95":1,"96":6,"97":6,"98":9,"99":3,"100":2,"101":1,"104":5,"109":2,"110":2,"117":1,"123":5,"124":1,"125":1,"126":1,"137":1,"195":1,"214":1,"237":1},"type":{"2":0,"3":0,"4":0,"5":2,"6":0,"7":0,"8":0,"9":0,"10":0,"11":0,"12":0,"13":0,"14":0,"15":2,"16":0,"17":0,"18":0,"19":0,"20":0,"21":2,"22":0,"23":1,"24":2,"25":0,"26":2,"27":1,"28":2,"29":0,"30":2,"31":1,"32":2,"33":2,"34":1,"35":0,"36":0,"37":0,"38":0,"39":1,"40":2,"51":0,"52":0,"53":0,"55":0,"56":0,"57":0,"58":0,"60":0,"61":0,"62":0,"63":1,"64":2,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":1,"72":2,"73":0,"74":0,"75":0,"76":0,"77":1,"78":0,"79":2,"80":0,"81":0,"82":0,"83":1,"84":0,"85":0,"86":1,"87":2,"90":0,"91":1,"92":2,"93":0,"94":0,"95":0,"96":1,"97":2,"98":0,"99":0,"100":0,"101":0,"104":2,"109":0,"110":0,"117":0,"123":0,"124":1,"125":2,"126":0,"137":0,"195":0,"214":0,"237":0},"utc":{"2":1622262813.0,"3":1622268922.0,"4":1622266453.0,"5":1622262766.0,"6":1622227111.0,"7":1622230836.0,"8":1622243556.0,"9":1622236535.0,"10":1622231396.0,"11":1622223777.0,"12":1622224128.0,"13":1622260174.0,"14":1622260059.0,"15":1622223645.0,"16":1622214339.0,"17":1622218586.0,"18":1622226607.0,"19":1622216084.0,"20":1622267765.0,"21":1622214273.0,"22":1622258631.0,"23":1622256529.0,"24":1622256529.0,"25":1622229038.0,"26":1622221420.0,"27":1622283311.0,"28":1622283311.0,"29":1622282953.0,"30":1622281485.0,"31":1622280288.0,"32":1622280288.0,"33":1622278390.0,"34":1622239435.0,"35":1622257935.0,"36":1622260088.0,"37":1622271264.0,"38":1622278616.0,"39":1622244941.0,"40":1622244941.0,"51":1622198921.0,"52":1622208527.0,"53":1622226103.0,"55":1622227599.0,"56":1622250559.0,"57":1622263880.0,"58":1622265104.0,"60":1622245705.0,"61":1622235329.0,"62":1622253957.0,"63":1622229179.0,"64":1622229179.0,"65":1622224680.0,"66":1622278968.0,"67":1622223775.0,"68":1622227931.0,"69":1622238341.0,"70":1622263967.0,"71":1622221333.0,"72":1622221333.0,"73":1622211573.0,"74":1622231806.0,"75":1622237761.0,"76":1622241724.0,"77":1622206896.0,"78":1622209751.0,"79":1622203802.0,"80":1622248100.0,"81":1622248887.0,"82":1622219114.0,"83":1622214587.0,"84":1622215190.0,"85":1622214630.0,"86":1622210130.0,"87":1622210130.0,"90":1622234048.0,"91":1622218074.0,"92":1622218074.0,"93":1622206630.0,"94":1622231969.0,"95":1622265874.0,"96":1622203864.0,"97":1622203864.0,"98":1622197967.0,"99":1622201798.0,"100":1622222936.0,"101":1622222416.0,"104":1622199614.0,"109":1622206687.0,"110":1622232609.0,"117":1622201406.0,"123":1622228126.0,"124":1622220465.0,"125":1622220465.0,"126":1622209953.0,"137":1622283703.0,"195":1622219838.0,"214":1622283862.0,"237":1622277839.0},"sub_id":{"2":"nnfjq4","3":"nnfjq4","4":"nnfjq4","5":"nnfjq4","6":"nn380s","7":"nn380s","8":"nn380s","9":"nn380s","10":"nn380s","11":"nn380s","12":"nn380s","13":"nn380s","14":"nn380s","15":"nn380s","16":"nmzt7b","17":"nmzt7b","18":"nmzt7b","19":"nmzt7b","20":"nmzt7b","21":"nmzt7b","22":"nndulx","23":"nndulx","24":"nndulx","25":"nn2ebq","26":"nn2ebq","27":"nnkfvn","28":"nnkfvn","29":"nnk0ft","30":"nnk0ft","31":"nnjq5t","32":"nnjq5t","33":"nnjai4","34":"nn8w7k","35":"nnamx8","36":"nnamx8","37":"nnamx8","38":"nnamx8","39":"nnamx8","40":"nnamx8","51":"nmrxsl","52":"nmrxsl","53":"nmrxsl","55":"nmrxsl","56":"nmrxsl","57":"nmrxsl","58":"nmrxsl","60":"nn58k3","61":"nn58k3","62":"nn58k3","63":"nn58k3","64":"nn58k3","65":"nn2d4g","66":"nn2d4g","67":"nn2d4g","68":"nn2d4g","69":"nn2d4g","70":"nn2d4g","71":"nn2d4g","72":"nn2d4g","73":"nmxcdl","74":"nmxcdl","75":"nmxcdl","76":"nmxcdl","77":"nmxcdl","78":"nmwggt","79":"nmwggt","80":"nmzx4n","81":"nmzx4n","82":"nmzx4n","83":"nmzx4n","84":"nmyd8g","85":"nmyd8g","86":"nmyd8g","87":"nmyd8g","90":"nn16j1","91":"nn16j1","92":"nn16j1","93":"nmwh52","94":"nmwh52","95":"nmwh52","96":"nmwh52","97":"nmwh52","98":"nmuarg","99":"nmuarg","100":"nmuarg","101":"nmuarg","104":"nmvapk","109":"nmlpgt","110":"nmlpgt","117":"nmlpgt","123":"nn21eh","124":"nn21eh","125":"nn21eh","126":"nmudh4","137":"nmgn3c","195":"nmcepx","214":"nlufej","237":"nlwghj"}}